<?php

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class PageSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('pages')->insert([
            'slug'=> "kyf-naaml",
            'title_ar'=>"كيف نعمل",
            'content_ar'=>'<section class="how-do-text">
            <section class="right">
            <h2>لماذا تحقق</h2>
           <h4>!كيف يمكننا مساعدتك في تحقق</h4>
           <h6>هناك حقيقة مثبتة منذ زمن طويل وهي أن المحتوى المقروء لصفحة ما سيلهي القارئ عن التركيز على الشكل </h6>
           <p>بالنسبة لمستخدمي الاتحاد الأوروبي والمستخدمين في البلدان الأخرى التي لديها تشريعات لحماية البيانات تتطلب حذف بيانات المستخدم الشخصية بعد مرور بعض الوقت ، سيتم حذف بيانات حسابك تلقائيًا بعد 7 سنوات من عدم النشاط. يتم تعريف عدم النشاط على أنه عدم التفاعل مع محتوى الدورة التدريبية. بعد ٧ سنوات من عدم النشاط ، سوف نتصل بك مع إشعار مسبق لمدة شهر واحد ، لإبلاغك بأنه سيتم حذف بياناتك الشخصية من أجهزة الكمبيوتر التي يتم تخزينها عليها ، ومنحك خيار طلب الاحتفاظ ببياناتك الشخصية لمدة ٧ أخرى. سنوات
           </p>
            </section>
            <section class="left">
            <img src="img/1212121221.png">
            </section>
        </section>
        <section class="how-do-imge">
            <img src="img/ass.png">

        </section>
        <section class="courses wow fadeIn" style="margin-bottom: 10%;">
            <div class="container">
                <div class="home-wrap">
                    <div class="text">
                        <span class="wow fadeInDown"> كيف يعمل تحقق </span>
                        <p class="wow fadeInDown" style="font-size: 8px !important; margin-top: 4%;">هناك حقيقة مثبتة منذ زمن طويل وهي أن المحتوى المقروء لصفحة ما سيلهي القارئ عن التركيز على الشكل الخارجي للنص أو شكل توضع الفقرات في الصفحة التي يقرأها. ولذلك يتم استخدام طريقة لوريم إيبسوم لأنها تعطي توزيعاَ طبيعياَ -إلى حد ما- للأحرف عوضاً عن استخدام "هنا يوجد محتوى نصي، هنا يوجد محتوى نصي" فتجعلها تبدو (أي الأحرف) وكأنها نص مقروء. العديد من برامح النشر المكتبي وبرامح تحرير صفحات الويب تستخدم لوريم إيبسوم بشكل إفتراضي كنموذج عن النص، وإذا قمت بإدخال "lorem ipsum" في أي محرك بحث ستظهر العديد من المواقع الحديثة العهد في نتائج البحث. على مدى السنين ظهرت نسخ جديدة ومختلفة من نص لوريم إيبسوم، أحياناً عن طريق الصدفة، وأحياناً عن عمد كإدخال بعض العبارات الفكاهية إليها.

                        </p>

                    </div>
                    <img src="img/Elements-Image-Browser-1.png" class="wow fadeInDown" style="float: right; margin-left: 4%;">
                </div>
            </div>
        </section>',
            'title_en' =>" ",
            'content_en' =>" ",
            'tags' =>'[{"value":"قوالب ورد برس"},{"value":"ورد برس"},{"value":"تحقق"},{"value":"كيف نعمل"}]',

        ]);
        DB::table('pages')->insert([
            'slug'=> "mn-nhn",
            'title_ar'=>"من نحن",
            'content_ar'=>'<section class="howtahqq">
            <div class="howtext">
                <img src="img/Page-1.png">
                <h4> لماذا تحقق</h4>
                <h2> من هي شركة تحقق</h2>
                <h6>هناك حقيقة مثبتة منذ زمن طويل وهي أن المحتوى المقروء لصفحة ما سيلهي القارئ عن التركيز على الشكل </h6>
                <p>بالنسبة لمستخدمي الاتحاد الأوروبي والمستخدمين في البلدان الأخرى التي لديها تشريعات لحماية البيانات تتطلب حذف بيانات المستخدم الشخصية بعد مرور بعض الوقت ، سيتم حذف بيانات حسابك تلقائيًا بعد 7 سنوات من عدم النشاط. يتم تعريف عدم النشاط على أنه عدم التفاعل مع محتوى الدورة التدريبية. بعد ٧ سنوات من عدم النشاط ، سوف نتصل بك مع إشعار مسبق لمدة شهر واحد ، لإبلاغك بأنه سيتم حذف بياناتك الشخصية من أجهزة الكمبيوتر التي يتم تخزينها عليها ، ومنحك خيار طلب الاحتفاظ ببياناتك الشخصية لمدة ٧ أخرى. سنوات</p>
                <h6>هناك حقيقة مثبتة منذ زمن طويل وهي أن المحتوى المقروء لصفحة ما سيلهي القارئ عن التركيز على الشكل </h6>
                <p>يرحّب بكم فريق عمل منصة سلة عبر منصته الالكترونية، وتتقدّم منصة سلة بالشكر على ثقتكم بالمنصة، وتفيدكم منصة سلة بأنه حرصاً من منصة سلة وادراكها التام بأن التاجر له حقوق معيّنة عبر منصة سلة، فإن منصة سلة تسعى للحفاظ على المعلومات الخاصة بالتجار والمستهلكين وفقاً لآلية سياسة الخصوصية وسرية المعلومات المعمول بها في منصة سلة . وعليه فإن منصة سلة تنوّه بأنه وفقاً لاتفاقية الاستخدام المبرمة بينكم كتجار وبين منصة سلة فإن هذه الوثيقة تحيطكم علماً بسياسة الخصوصية وسرية المعلومات المعمول بها في منصة سلة، وأنه وفقاً للبند الرابع من المادة الخامسة عشرة من اتفاقية الاستخدام فقد أنشأت منصة سلة هذه القواعد “سياسة الخصوصية وسرية المعلومات” لتوضيح وتحديد آلية السرية والخصوصية المعمول بها في منصة سلة الالكترونية، ويرجى اطلاعكم عليها حيث أنكم بولوجكم إلى منصة سلة وتأسيسكم للمتجر الالكتروني فإن جميع معلوماتكم تخضع لهذه السياسة.</p>
                <h6>ما هو مدى أمان سرية المعلومات الخاصة بالتُجّار أو المستهلكين أو المتاجر</h6>
                <p>تعمل منصة سلة على حماية معلومات التُجّار والمتاجر بموجب أنظمة حماية إلكترونية وتقنية ذات جودة عالية وتُحدّث بشكل مستمر ودوري.
                    غير أنه نظراً لأن شبكة الانترنت لا يمكن ضمانها 100% لما قد يطرأ من اختراق أو فيروسات على أنظمة الحماية الالكترونية و على جدران الحماية المعمول بها في منصة سلة فإن منصة سلة تنصح التجار بالحفاظ على معلوماتهم بسرية تامة، وعدم إفشاء أي معلومات يراها التاجر هامة جداً له، وهذا حرصاً من منصة سلة على حماية وتوجيه وإرشاد التٌجّار والمتاجر.</p>
                <h6>هناك حقيقة مثبتة منذ زمن طويل وهي أن المحتوى المقروء لصفحة ما سيلهي القارئ عن التركيز على الشكل </h6>
                <p>يرحّب بكم فريق عمل منصة سلة عبر منصته الالكترونية، وتتقدّم منصة سلة بالشكر على ثقتكم بالمنصة، وتفيدكم منصة سلة بأنه حرصاً من منصة سلة وادراكها التام بأن التاجر له حقوق معيّنة عبر منصة سلة، فإن منصة سلة تسعى للحفاظ على المعلومات الخاصة بالتجار والمستهلكين وفقاً لآلية سياسة الخصوصية وسرية المعلومات المعمول بها في منصة سلة . وعليه فإن منصة سلة تنوّه بأنه وفقاً لاتفاقية الاستخدام المبرمة بينكم كتجار وبين منصة سلة فإن هذه الوثيقة تحيطكم علماً بسياسة الخصوصية وسرية المعلومات المعمول بها في منصة سلة، وأنه وفقاً للبند الرابع من المادة الخامسة عشرة من اتفاقية الاستخدام فقد أنشأت منصة سلة هذه القواعد “سياسة الخصوصية وسرية المعلومات” لتوضيح وتحديد آلية السرية والخصوصية المعمول بها في منصة سلة الالكترونية، ويرجى اطلاعكم عليها حيث أنكم بولوجكم إلى منصة سلة وتأسيسكم للمتجر الالكتروني فإن جميع معلوماتكم تخضع لهذه السياسة.</p>
            </div>
            <div class="peopletahqq">
                <h4> عملاء تحقق</h4>
                <h6> أبرز عملاء تحقق</h6>


            </div>

        </section>',
            'title_en' =>" ",
            'content_en' =>" ",
            'tags' =>'[{"value":"تحقق"},{"value":"من نحن"},{"value":"ورد برس"}]',

        ]);
        DB::table('pages')->insert([
            'slug'=> "syas-alkhsosy",
            'title_ar'=>"سياسة الخصوصية",
            'content_ar'=>'<section class="how-do-text">
            <section class="right">
            <h2>لماذا تحقق</h2>
           <h4> سياسة الخصوصية وسرية المعلومات</h4>
           <h6>هناك حقيقة مثبتة منذ زمن طويل وهي أن المحتوى المقروء لصفحة ما سيلهي القارئ عن التركيز على الشكل  </h6>
        <p>بالنسبة لمستخدمي الاتحاد الأوروبي والمستخدمين في البلدان الأخرى التي لديها تشريعات لحماية البيانات تتطلب حذف بيانات المستخدم الشخصية بعد مرور بعض الوقت ، سيتم حذف بيانات حسابك تلقائيًا بعد 7 سنوات من عدم النشاط. يتم تعريف عدم النشاط على أنه عدم التفاعل مع محتوى الدورة التدريبية. بعد ٧ سنوات من عدم النشاط ، سوف نتصل بك مع إشعار مسبق لمدة شهر واحد ، لإبلاغك بأنه سيتم حذف بياناتك الشخصية من أجهزة الكمبيوتر التي يتم تخزينها عليها ، ومنحك خيار طلب الاحتفاظ ببياناتك الشخصية لمدة ٧ أخرى. سنوات   </p>
            </section>
            <section class="left">
            <img src="img/ssss.png">
            </section>
            <br> <br>
            <h6>  هناك حقيقة مثبتة منذ زمن طويل وهي أن المحتوى المقروء لصفحة ما سيلهي القارئ عن التركيز على الشكل   </h6>
            <p>
                يرحّب بكم فريق عمل منصة سلة عبر منصته الالكترونية، وتتقدّم منصة سلة بالشكر على ثقتكم بالمنصة، وتفيدكم منصة سلة بأنه حرصاً من منصة سلة وادراكها التام بأن التاجر له حقوق معيّنة عبر منصة سلة، فإن منصة سلة تسعى للحفاظ على المعلومات الخاصة بالتجار والمستهلكين وفقاً لآلية سياسة الخصوصية وسرية المعلومات المعمول بها في منصة سلة . وعليه فإن منصة سلة تنوّه بأنه وفقاً لاتفاقية الاستخدام المبرمة بينكم كتجار وبين منصة سلة فإن هذه الوثيقة تحيطكم علماً بسياسة الخصوصية وسرية المعلومات المعمول بها في منصة سلة، وأنه وفقاً للبند الرابع من المادة الخامسة عشرة من اتفاقية الاستخدام فقد أنشأت منصة سلة هذه القواعد “سياسة الخصوصية وسرية المعلومات” لتوضيح وتحديد آلية السرية والخصوصية المعمول بها في منصة سلة الالكترونية، ويرجى اطلاعكم عليها حيث أنكم بولوجكم إلى منصة سلة وتأسيسكم للمتجر الالكتروني فإن جميع معلوماتكم تخضع لهذه السياسة.
            </p>
            <h6>
                ما هو مدى أمان سرية المعلومات الخاصة بالتُجّار أو المستهلكين أو المتاجر
            </h6>
            <p> تعمل منصة سلة على حماية معلومات التُجّار والمتاجر بموجب أنظمة حماية إلكترونية وتقنية ذات جودة عالية وتُحدّث بشكل مستمر ودوري.
                غير أنه نظراً لأن شبكة الانترنت لا يمكن ضمانها 100% لما قد يطرأ من اختراق أو فيروسات على أنظمة الحماية الالكترونية و على جدران الحماية المعمول بها في منصة سلة فإن منصة سلة تنصح التجار بالحفاظ على معلوماتهم بسرية تامة، وعدم إفشاء أي معلومات يراها التاجر هامة جداً له، وهذا حرصاً من منصة سلة على حماية وتوجيه وإرشاد التٌجّار والمتاجر.</p>
            <h6>
                قواعد وأحكام استخدام منصة سلة
            </h6>
            <p>
                إن جميع التزامات منصة سلة، وجميع التزامات التجار، وجميع الحقوق الواردة في العلاقة بين التاجر ومنصة سلة، موجودة هنا “يوضع الرابط”، حيث أن هذه القواعد هي “سياسة الخصوصية وسرية المعلومات” والمنبثقة من الاتفاقية التي ابرمت بين التاجر ومنصة سلة عند تأسيسه للمتجر، وقد وضعت سياسة الخصوصية وسرية المعلومات لضمان المصداقية والثقة التي تحرص منصة سلة على توفيرها للتجار.</p><p>
            </p>
        </section>',
            'title_en' =>" ",
            'content_en' =>" ",
            'tags' =>'[{"value":"قوالب ورد برس"},{"value":"ورد برس"},{"value":"تحقق"},{"value":"كيف نعمل"}]',

        ]);
    }
}
