<?php

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class PageSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('pages')->insert([
            'slug'=> "kyf-naaml",
            'title_ar'=>"كيف نعمل",
            'content_ar'=>'<p></p><div class="d-grid  mb-1  text-right">
            <div class="row">
                <div class="col col-md-6 col-sm-11 right-side-who  mx-5 mb-5 mt-1 text-right">
                    <p class="heading mt-4">ماذا تحقق</p>
                    <h1 class="sub-heading h3 primery-color mt-3 mb-5">من هي شركة تحقق</h1>
                    <div>
                        <h1 class=" mb-3 heading" style="line-height: 36.5px;">هناك حقيقة مثبتة منذ زمن طويل وهي أن المحتوى المقروء لصفحة ما
                            سيلهي
                            القارئ عن التركيز على الشكل</h1>
                        <p class=" my-5 pl-4 heading-p">بالنسبة لمستخدمي الاتحاد الأوروبي والمستخدمين في البلدان الأخرى
                            التي
                            لديها
                            تشريعات لحماية
                            البيانات تتطلب حذف بيانات المستخدم الشخصية بعد مرور بعض الوقت ، سيتم حذف بيانات حسابك
                            تلقائيًا بعد 7 سنوات من عدم النشاط. يتم تعريف عدم النشاط على أنه عدم التفاعل مع محتوى
                            الدورة
                            التدريبية. بعد ٧ سنوات من عدم النشاط ، سوف نتصل بك مع إشعار مسبق لمدة شهر واحد ، لإبلاغك
                            بأنه سيتم حذف بياناتك الشخصية من أجهزة الكمبيوتر التي يتم تخزينها عليها ، ومنحك خيار طلب
                            الاحتفاظ ببياناتك الشخصية لمدة ٧ أخرى. سنوات</p>

                    </div>
                </div>

                <div class="col col-md-5  d-flex align-items-center justify-content-center img-cont">
                    <img class=" image-size img-fluid" src="newasset/img/1212121221.png" alt=""></div><div class="col col-md-5  d-flex align-items-center justify-content-center img-cont"><br></div><div class="col col-md-5  d-flex align-items-center justify-content-center img-cont"><br></div><div class="col col-md-5  d-flex align-items-center justify-content-center img-cont">
                </div>
            </div>
        </div>

<img src="newasset/img/ass.png" class="img-fluid rounded mx-auto d-block">
<br><br><br><br><br><br>

<div class="d-grid  mb-1  text-right">
            <div class="row">
<div class="col col-md-5  d-flex align-items-center justify-content-center img-cont">
                    <img class="image-size img-fluid note-float-right" src="newasset/img/12222.png" alt="" style="float: right;">
                </div>
                <div class="col col-md-6 col-sm-11 right-side-who  mx-5 mb-5 mt-1 text-right">


                    <div>
                        <h1 class=" mb-3 heading">كيف يعمل تحقق</h1>
                        <p class=" my-5 pl-4 heading-p">هناك حقيقة مثبتة منذ زمن طويل وهي أن المحتوى المقروء لصفحة ما سيلهي القارئ عن التركيز على الشكل الخارجي للنصأو
شكل توضع الفقرات في الصفحة التي يقرأها. ولذلك يتم استخدام طريقة لوريم إيبسوم لأنها تعطي توزيعاَ طبيعياَ -إلى حد ما-
للأحرف عوضاً عن استخدام "هنا يوجد محتوى نصي، هنا يوجد محتوى نصي" فتجعلها تبدو (أي الأحرف) وكأنها نصمقروء.
العديد من برامح النشر المكتبي وبرامح تحرير صفحات الويب تستخدم لوريم إيبسوم بشكل إفتراضي كنموذج عن النص، وإذا قمت
بإدخال "ipsum lorem "في أي محرك بحث ستظهر العديد من المواقع الحديثة العهد في نتائج البحث. على مدى السنين ظهرت
نسخ جديدة ومختلفة من نصلوريم إيبسوم، أحياناً عن طريق الصدفة، وأحياناً عن عمد كإدخال بعضالعبارات الفكاهية إليها.</p>

                    </div>
                </div>


            </div>
        </div>',
            'title_en' =>" ",
            'content_en' =>" ",
            'tags' =>'[{"value":"قوالب ورد برس"},{"value":"ورد برس"},{"value":"تحقق"},{"value":"كيف نعمل"}]',

        ]);
        DB::table('pages')->insert([
            'slug'=> "mn-nhn",
            'title_ar'=>"من نحن",
            'content_ar'=>'<!--content-->
            <div class="d-grid  mb-1  text-right">
                <div class="row">
                    <div class="col col-md-6 col-sm-11 right-side-who  mx-5 mb-5 mt-1 text-right">
                        <p class="heading mt-4">لماذا تحقق</p>
                        <h1 class="sub-heading h3 primery-color mt-3 mb-5">من هي شركة تحقق</h1>
                        <div class="">
                            <h1 class=" mb-3 heading">هناك حقيقة مثبتة منذ زمن طويل وهي أن المحتوى المقروء لصفحة ما
                                سيلهي
                                القارئ عن التركيز على الشكل</h1>
                            <p class=" my-5 pl-4 heading-p">بالنسبة لمستخدمي الاتحاد الأوروبي والمستخدمين في البلدان الأخرى
                                التي
                                لديها
                                تشريعات لحماية
                                البيانات تتطلب حذف بيانات المستخدم الشخصية بعد مرور بعض الوقت ، سيتم حذف بيانات حسابك
                                تلقائيًا بعد 7 سنوات من عدم النشاط. يتم تعريف عدم النشاط على أنه عدم التفاعل مع محتوى
                                الدورة
                                التدريبية. بعد ٧ سنوات من عدم النشاط ، سوف نتصل بك مع إشعار مسبق لمدة شهر واحد ، لإبلاغك
                                بأنه سيتم حذف بياناتك الشخصية من أجهزة الكمبيوتر التي يتم تخزينها عليها ، ومنحك خيار طلب
                                الاحتفاظ ببياناتك الشخصية لمدة ٧ أخرى. سنوات</p>

                        </div>
                    </div>

                    <div class="col col-md-5  d-flex align-items-center justify-content-center img-cont">
                        <img class=" image-size img-fluid" src="/img/Page-1.png" alt="">
                    </div>
                </div>
            </div>
            <!--content-->
            <div class="content-who text-right mx-5 mt-5">
                <h1 class="h3  heading">هناك حقيقة مثبتة منذ زمن طويل وهي أن المحتوى المقروء لصفحة ما
                    سيلهي
                    القارئ عن التركيز على الشكل</h1>
                <p class=" my-5 mx-0 heading-p">يرحّب بكم فريق عمل منصة سلة عبر منصته الالكترونية، وتتقدّم منصة سلة بالشكر
                    على ثقتكم
                    بالمنصة، وتفيدكم منصة سلة بأنه حرصاً من منصة سلة وادراكها التام بأن التاجر له حقوق معيّنة عبر منصة سلة،
                    فإن منصة سلة تسعى للحفاظ على المعلومات الخاصة بالتجار والمستهلكين وفقاً لآلية سياسة الخصوصية وسرية
                    المعلومات المعمول بها في منصة سلة . وعليه فإن منصة سلة تنوّه بأنه وفقاً لاتفاقية الاستخدام المبرمة بينكم
                    كتجار وبين منصة سلة فإن هذه الوثيقة تحيطكم علماً بسياسة الخصوصية وسرية المعلومات المعمول بها في منصة
                    سلة، وأنه وفقاً للبند الرابع من المادة الخامسة عشرة من اتفاقية الاستخدام فقد أنشأت منصة سلة هذه القواعد
                    “سياسة الخصوصية وسرية المعلومات” لتوضيح وتحديد آلية السرية والخصوصية المعمول بها في منصة سلة
                    الالكترونية، ويرجى اطلاعكم عليها حيث أنكم بولوجكم إلى منصة سلة وتأسيسكم للمتجر الالكتروني فإن جميع
                    معلوماتكم تخضع لهذه السياسة.
                </p>
            </div>
            <!--content-->
            <div class="content-who  text-right mx-5 mt-4">
                <h1 class="h3 heading">هناك حقيقة مثبتة منذ زمن طويل وهي أن المحتوى المقروء لصفحة ما
                    سيلهي
                    القارئ عن التركيز على الشكل</h1>
                <p class=" my-5 heading-p">
                    تعمل منصة سلة على حماية معلومات التُجّار والمتاجر بموجب أنظمة حماية إلكترونية وتقنية ذات جودة عالية
                    وتُحدّث بشكل مستمر ودوري. غير أنه نظراً لأن شبكة الانترنت لا يمكن ضمانها 100% لما قد يطرأ من اختراق أو
                    فيروسات على أنظمة الحماية الالكترونية و على جدران الحماية المعمول بها في منصة سلة فإن منصة سلة تنصح
                    التجار بالحفاظ على معلوماتهم بسرية تامة، وعدم إفشاء أي معلومات يراها التاجر هامة جداً له، وهذا حرصاً من
                    منصة سلة على حماية وتوجيه وإرشاد التٌجّار والمتاجر.
                </p>
            </div>
            <!--content-->
            <div class="content-who  text-right mx-5 mt-4 ">
                <div class="d-flex">
                    <div class="ml-4 custom-square"></div>
                    <h1 class="h3 heading">هناك حقيقة مثبتة منذ زمن طويل وهي أن المحتوى المقروء لصفحة ما
                        سيلهي
                        القارئ عن التركيز على الشكل</h1>
                </div>
                <p class="my-5 mr-5 heading-p">
                    يرحّب بكم فريق عمل منصة سلة عبر منصته الالكترونية، وتتقدّم منصة سلة بالشكر على ثقتكم بالمنصة، وتفيدكم
                    منصة سلة بأنه حرصاً من منصة سلة وادراكها التام بأن التاجر له حقوق معيّنة عبر منصة سلة، فإن منصة سلة تسعى
                    للحفاظ على المعلومات الخاصة بالتجار والمستهلكين وفقاً لآلية سياسة الخصوصية وسرية المعلومات المعمول بها
                    في منصة سلة . وعليه فإن منصة سلة تنوّه بأنه وفقاً لاتفاقية الاستخدام المبرمة بينكم كتجار وبين منصة سلة
                    فإن هذه الوثيقة تحيطكم علماً بسياسة الخصوصية وسرية المعلومات المعمول بها في منصة سلة، وأنه وفقاً للبند
                    الرابع من المادة الخامسة عشرة من اتفاقية الاستخدام فقد أنشأت منصة سلة هذه القواعد “سياسة الخصوصية وسرية
                    المعلومات” لتوضيح وتحديد آلية السرية والخصوصية المعمول بها في منصة سلة الالكترونية، ويرجى اطلاعكم عليها
                    حيث أنكم بولوجكم إلى منصة سلة وتأسيسكم للمتجر الالكتروني فإن جميع معلوماتكم تخضع لهذه السياسة.
                </p>
            </div>',
            'title_en' =>" ",
            'content_en' =>" ",
            'tags' =>'[{"value":"تحقق"},{"value":"من نحن"},{"value":"ورد برس"}]',

        ]);
        DB::table('pages')->insert([
            'slug'=> "syas-alkhsosy",
            'title_ar'=>"سياسة الخصوصية",
            'content_ar'=>'<div class="d-grid  mb-1  text-right">
            <div class="row">
                <div class="col col-md-6 col-sm-11 right-side-who  mx-5 mb-5 mt-1 text-right">
                    <p class="heading mt-4">لماذا تحقق</p>
                    <h1 class="sub-heading h3 primery-color mt-3 mb-5">سياسة الخصوصية وسرية المعلومات</h1>
                    <div class="">
                        <h1 class=" mb-3 heading">هناك حقيقة مثبتة منذ زمن طويل وهي أن المحتوى المقروء لصفحة ما
                                    سيلهي
                                    القارئ عن التركيز على الشكل</h1>
                        <p class=" my-5 pl-4 heading-p">بالنسبة لمستخدمي الاتحاد الأوروبي والمستخدمين في البلدان الأخرى التي لديها تشريعات لحماية البيانات تتطلب حذف بيانات المستخدم الشخصية بعد مرور بعض الوقت ، سيتم حذف بيانات حسابك تلقائيًا بعد 7 سنوات من عدم النشاط. يتم تعريف عدم النشاط على أنه عدم التفاعل مع محتوى الدورة التدريبية. بعد ٧ سنوات من عدم النشاط ، سوف نتصل بك مع إشعار مسبق لمدة شهر واحد ، لإبلاغك بأنه سيتم حذف بياناتك الشخصية من أجهزة الكمبيوتر التي يتم تخزينها عليها ، ومنحك خيار طلب الاحتفاظ ببياناتك الشخصية لمدة ٧ أخرى. سنوات</p>
                    </div>
                </div>
                <div class="col col-md-5  d-flex align-items-center justify-content-center img-cont">
                    <img class=" image-size img-fluid" src="/img/ssss.png" alt="">
                </div>
            </div>
        </div>
        <div class="content-who  text-right mx-5 mt-4 ">
            <div class="d-flex">
                <div class="ml-4 custom-square"></div>
                <h1 class="h3 heading">هناك حقيقة مثبتة منذ زمن طويل وهي أن المحتوى المقروء لصفحة ما
                            سيلهي
                            القارئ عن التركيز على الشكل</h1>
            </div>
            <p class="my-5 mr-5 heading-p">يرحّب بكم فريق عمل منصة سلة عبر منصته الالكترونية، وتتقدّم منصة سلة بالشكر على ثقتكم بالمنصة، وتفيدكم منصة سلة بأنه حرصاً من منصة سلة وادراكها التام بأن التاجر له حقوق معيّنة عبر منصة سلة، فإن منصة سلة تسعى للحفاظ على المعلومات الخاصة بالتجار والمستهلكين وفقاً لآلية سياسة الخصوصية وسرية المعلومات المعمول بها في منصة سلة . وعليه فإن منصة سلة تنوّه بأنه وفقاً لاتفاقية الاستخدام المبرمة بينكم كتجار وبين منصة سلة فإن هذه الوثيقة تحيطكم علماً بسياسة الخصوصية وسرية المعلومات المعمول بها في منصة سلة، وأنه وفقاً للبند الرابع من المادة الخامسة عشرة من اتفاقية الاستخدام فقد أنشأت منصة سلة هذه القواعد “سياسة الخصوصية وسرية المعلومات” لتوضيح وتحديد آلية السرية والخصوصية المعمول بها في منصة سلة الالكترونية، ويرجى اطلاعكم عليها حيث أنكم بولوجكم إلى منصة سلة وتأسيسكم للمتجر الالكتروني فإن جميع معلوماتكم تخضع لهذه السياسة.</p>
        </div>
        <div class="content-who  text-right mx-5 mt-4 ">
            <div class="d-flex">
                <div class="ml-4 custom-square"></div>
                <h1 class="h3 heading">ما هو مدى أمان سرية المعلومات الخاصة با ُلت ّجار أو المستهلكين أو المتاجر</h1>
            </div>
            <p class="my-5 mr-5 heading-p">تعمل منصة سلة على حماية معلومات الُت ّجار والمتاجر بموجب أنظمة حماية إلكترونية وتقنية ذات جودة عالية وُتحّدث بشكل مستمر ودوري. غير أنه نظراً لأن شبكة الانترنت لا يمكن ضمانها 100 %لما قد يطرأ من اختراق أو فيروسات على أنظمة الحماية الالكترونية و على جدران الحماية المعمول بها في منصة سلة فإن منصة سلة تنصح التجار بالحفاظ على معلوماتهم بسرية تامة، وعدم إفشاء أي معلومات يراها التاجر هامة جداً له، وهذا حرصاً من منصة سلة على حماية وتوجيه وإرشاد الٌت ّجار والمتاجر</p>
        </div>
        <div class="content-who  text-right mx-5 mt-4 ">
            <div class="d-flex">
                <div class="ml-4 custom-square"></div>
                <h1 class="h3 heading">قواعد وأحكام استخدام منصة سلة</h1>
            </div>
            <p class="my-5 mr-5 heading-p">إن جميع التزامات منصة سلة، وجميع التزامات التجار، وجميع الحقوق الواردة في العلاقة بين التاجر ومنصة سلة، موجودة هنا ”يوضع الرابط“، حيث أن هذه القواعد هي ”سياسة الخصوصية وسرية المعلومات“ والمنبثقة من الاتفاقية التي ابرمت بين التاجر ومنصة سلة عند تأسيسه للمتجر، وقد وضعت سياسة الخصوصية وسرية المعلومات لضمان المصداقية والثقة التي تحرصمنصة سلة على توفيرها للتجار.</p>
        </div>',
            'title_en' =>" ",
            'content_en' =>" ",
            'tags' =>'[{"value":"قوالب ورد برس"},{"value":"ورد برس"},{"value":"تحقق"},{"value":"كيف نعمل"}]',

        ]);
    }
}
